<?php

return [
    'app_name' => 'منصة إتقان للتعليم الألكتروني',
    'copyrights' => 'برمجة وتصميم قسم التعليم الالكتروني - 2020',
    'about-title' => 'نبذة عن المنصة',
    'mission-training' => 'التدريب المرتكز على المهمة',
    'our-courses' => 'دورات المعهد',
    'multimedia' => 'وسائط متعددة',
    'subscripe' => 'الاشتراك',
    'videos' => 'الفيديو',
    'files' => 'المراجع',
    'quiz' => 'اختبار',
    'suggestions' => 'مقترحات',
    'video-not-supported' => 'هذا المتصفح لا يدعم ملفات الفيديو',
    'rank' => 'الرتبة',
    'name' => 'الاسم',
    'military_number' => 'الرقم العسكري',
    'department' => 'الإدارة / القسم',
    'suggestion' => 'المقترح',
    'send' => 'إرسال',
    'admin' => 'دخول المشرفين',    

    'suggestion-message' => 'شكراً لاقتراحك ، سيتم دراسة الاقتراح من قبل اللجنة المخصصة للنظام.',
    'error' => 'خطأ غير معروف! الرجاء المحاولة لاحقاً',

    'prev' => 'السابق',
    'next' => 'التالي',
    'finish' => 'إنهاء',
    'please-wait' => 'الرجاء الإنتظار',
    'close' => 'إغلاق',

    'letters' => [
        'A' => 'أ',
        'B' => 'ب',
        'C' => 'ج',
        'D' => 'د',

        'أ' => 'A',
        'ب' => 'B',
        'ج' => 'C',
        'د' => 'D',
    ],

    'order' => [
        'الأول',
        'الثاني',
        'الثالث',
        'الرابع',
        'الخامس',
        'السادس',
        'السابع',
        'الثامن',
        'التاسع',
        'العاشر',
        'الحادي عشر',
        'الثاني عشر',
        'الثالث عشر',
        'الرابع عشر',
        'الخامس عشر',
        'السادس عشر',
        'السابع عشر',
        'الثامن عشر',
        'التاسع عشر',
        'العشرون'
    ],

    'levels' => [
        'المحتوى المعرفي للمستوى المهاري الأول',
        'المحتوى المعرفي للمستوى المهاري الثاني',
        'المحتوى المعرفي للمستوى المهاري الثالث',
        'المحتوى المعرفي للمستوى المهاري الرابع',
    ],

    'course-title' => 'دورة :name',
    'course-lessons' => 'عدد الدروس :count',

    'no' => [
        'courses' => 'لم يتم إضافة دورات',
        'files' => 'لم يتم إضافة مراجع',
        'lessons' => 'لم يتم إضافة دروس',
        'questions' => 'لم يتم إضافة أسئلة',
    ],
];